bit-finance/Reports/бит_УдалитьУниверсальныйОтчетИсточникиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_УдалитьУниверсальныйОтчетИсточникиДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Comment>Настройка пула подключений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Reports/бит_УдалитьУниверсальныйОтчетИсточникиДанных/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПоИсточнику(ТаблицаПараметры, ТаблицаОтборов) Экспорт
	
	Перем НаборДанных;
	
	ИсточникДанных = НастройкаОтчета.ИсточникДанных;
	
	ГраницаНач = Период.ДатаНачала;
	ГраницаКон = Новый Граница(КонецДня(Период.ДатаОкончания), ВидГраницы.Включая);
	
	СтруктураПараметров = бит_МеханизмПолученияДанных.ЗаполнитьСтруктуруПараметровИзТаблицы(ТаблицаПараметры);
	
	Если ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		СтрПар = бит_МеханизмПолученияДанных.НовыепараметрыПолучитьДанныеПоИсточнику();
		СтрПар.Параметры    = СтруктураПараметров;
		СтрПар.ОтборВОтчете = ТаблицаОтборов;
		СтрПар.НастройкаПулаПодключений = НастройкаПулаПодключений;			
		
		НаборДанных = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(ИсточникДанных, ГраницаНач, ГраницаКон, СтрПар);
		
	ИначеЕсли ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") Тогда	
		
		СтруктураПараметров.Вставить("ВалютаОтчета", ВалютаДокумента);
		
		ПоказыватьИндикатор = Не бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("НеОтображатьИндикаторКомпоновкиИсточников",
									Пользователи.ТекущийПользователь());
		
		СтрПар = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки();
		СтрПар.Параметры                = СтруктураПараметров;
		СтрПар.ОтборВОтчете             = ТаблицаОтборов;
		СтрПар.ПоказыватьИндикатор      = ПоказыватьИндикатор;
		СтрПар.НастройкаПулаПодключений = НастройкаПулаПодключений;
		
		НаборДанных = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточникамМП(ИсточникДанных, ГраницаНач, ГраницаКон, СтрПар);
		
		бит_МеханизмПолученияДанных.ДополнитьРезультатИВыполнитьРасчет(ИсточникДанных, НаборДанных);
		
	КонецЕсли;

	Возврат НаборДанных;
	
КонецФункции

// Процедура преобразует заголовки.
// 
// Параметры:
//  ТекущаяСхема - СхемаКомпоновкиДанных.
// 
Процедура ИзменитьЗаголовкиПоПараметрам(ТекущаяСхема)
         	
	Если Не ЗначениеЗаполнено(Язык) Тогда
		Возврат; 
	КонецЕсли;
	
	ТчПараметры = НастройкаОтчета.Параметры;
	КодЯзыка    = Язык.КодЯзыка;
	
	
	// ----------------------------------------------------------------------
	// Заголовок.
	ЗаголовокОтчетаЯзык = НСтр(НастройкаОтчета.ЗаголовокОтчета, КодЯзыка);
	Если ЗначениеЗаполнено(ЗаголовокОтчетаЯзык) Тогда
		КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title")).Значение = ЗаголовокОтчетаЯзык;
	КонецЕсли;
	
	
	// ----------------------------------------------------------------------
	// Обработка заголовков колонок - из табличной части "Параметры" справочника бит_НастройкиОтчетов.	
	Если ТчПараметры.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;
	
	
	// Колонки
	ПоляНабораДанных = ТекущаяСхема.НаборыДанных.мТаблицаРезультат.Поля;
	// Цикл по полям набора данных.
	Для каждого ПолеНабора Из ПоляНабораДанных Цикл   			 
		
		ИмяПоляНд 	   = СокрЛП(ПолеНабора.Поле);
		// Поиск параметра с заголовком в табличной части настройки.
	 	СтрТчПараметры = ТчПараметры.Найти(ИмяПоляНд, "Параметр");
		
		Если СтрТчПараметры <> Неопределено Тогда
			
			НовоеЗначение = СокрЛП(НСтр(СтрТчПараметры.Значение, КодЯзыка));
			Если ЗначениеЗаполнено(НовоеЗначение) Тогда
				ПолеНабора.Заголовок = НовоеЗначение;
			КонецЕсли;
			
		КонецЕсли;  
	КонецЦикла;
	
	
	// Макеты. 
	Для каждого МакетКд Из ТекущаяСхема.Макеты Цикл
		Для каждого СтрокаТаблицыОбластиКд Из МакетКд.Макет Цикл
			Для каждого ЯчейкаТаблицыОбластиКд Из СтрокаТаблицыОбластиКд.Ячейки Цикл
				Для каждого ПолеОбластиКд Из ЯчейкаТаблицыОбластиКд.Элементы Цикл
					
					// Значение поля области компоновки данных.     						
					ЗначениеПоля = ПолеОбластиКд.Значение;
					// Если тип значения = Строка, то нужно подставить заголовки.
					Если ТипЗнч(ЗначениеПоля) = Тип("Строка") Тогда
						
						// Поиск вхождений параметров для замены: [ИмяПараметра].
						МассивСтрПарам = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ЗначениеПоля, "[");
						Для каждого СтрокаПоиска Из МассивСтрПарам Цикл
							ПозицияЗакрытия = Найти(СтрокаПоиска, "]");
							Если ПозицияЗакрытия = 0 Тогда
								Продолжить;
							Иначе	
								СтрокаПараметр = Лев(СтрокаПоиска, ПозицияЗакрытия-1);
								СтрТчПараметры = ТчПараметры.Найти(СтрокаПараметр, "Параметр");
								Если СтрТчПараметры <> Неопределено Тогда
									НовоеЗначение = СокрЛП(НСтр(СтрТчПараметры.Значение, КодЯзыка));
									СтрокаПараметр = "[" + СтрокаПараметр + "]";
									ПолеОбластиКд.Значение = СтрЗаменить(ПолеОбластиКд.Значение, СтрокаПараметр, НовоеЗначение);
								КонецЕсли;
							КонецЕсли;
						
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;		
			КонецЦикла;			
		КонецЦикла; 		
	КонецЦикла;

КонецПроцедуры // ИзменитьЗаголовкиПоПараметрам()

// Процедура инициализирует СКД.
// 
// Параметры:
//  СтруктураТаблиц					- Структура.
//  ТаблицаРезультат  				- ТаблицаЗначений.
//  ОбновлятьНастройкиПоУмолчанию 	- Булево (По умолчанию = Истина).
//  НастройкиКд 					- НастройкиКомпоновкиДанных (По умолчанию = Неопределено).
//  ПользовательскиеНастройкиКд     - ПользовательскиеНастройкиКомпоновщикаДанных (По умолчанию = Неопределено).
// 
Функция ИнициализироватьСКД(СтруктураТаблиц, ТаблицаРезультат, ОбновлятьНастройкиПоУмолчанию = Истина, 
	НастройкиКомпоновщика = Неопределено, ПользовательскиеНастройки = Неопределено) Экспорт

	АдресХранилищаСКД = Неопределено;
	ТаблицаОтборов    = СтруктураТаблиц.ОтборВОтчете;
	
	Если ТипЗнч(ПользовательскиеНастройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		НастройкиКомпоновщика = НастройкиКомпоновщика;
	Иначе
		НастройкиКомпоновщика = Новый НастройкиКомпоновкиДанных;
	КонецЕсли;
	
	Если ТипЗнч(ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		ПользовательскиеНастройки = ПользовательскиеНастройки;
	Иначе
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	КонецЕсли;
	
	// Если не заполнен реквизит "ИсточникДанных", то ничего не делаем.
	Если ЗначениеЗаполнено(НастройкаОтчета) И ЗначениеЗаполнено(НастройкаОтчета.ИсточникДанных) Тогда
		
		ТекущаяСхема  = НастройкаОтчета.СхемаКомпоновкиДанных.Получить();
		Если ТекущаяСхема <> Неопределено Тогда
			ВариантОтчета = НастройкаОтчета.ВариантОтчета.Получить();
			Если ТипЗнч(ВариантОтчета) = Тип("Строка") Тогда
				ВариантОтчета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВариантОтчета);
			Иначе
				ВариантОтчета = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
			КонецЕсли; 
			
			СхемаКомпоновкиДанных = ТекущаяСхема;
			ПреобразоватьСКД(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, ТекущаяСхема.НастройкиПоУмолчанию);
			
			АдресХранилищаСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
			Если ЗначениеЗаполнено(АдресХранилищаСКД) Тогда
				
				// Компоновщик настроек
				ИсточникНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресХранилищаСКД);
				КомпоновщикНастроек.Инициализировать(Неопределено);
				КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
				
				Если ЗначениеЗаполнено(НастройкиКомпоновщика.Выбор.Элементы) Тогда
					
					Если ЗначениеЗаполнено(ПользовательскиеНастройки.Элементы) Тогда
						// Загрузка старых вариантов
						ПреобразоватьСКД(НастройкиКомпоновщика, СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
						КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщика);							
					Иначе	
						// Загрузка новых вариантов
						КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщика);
						КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
					КонецЕсли;
					
				ИначеЕсли ЗначениеЗаполнено(ПользовательскиеНастройки.Элементы) Тогда
					
					// Основные настройки по умолчанию + пользовательские настройки.
					КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
					КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
					
				ИначеЕсли ОбновлятьНастройкиПоУмолчанию Тогда
					
					// Все настройки по умолчанию
					КомпоновщикНастроек.ЗагрузитьНастройки(ВариантОтчета);
				КонецЕсли;
				
				// Перезаполним выбранные поля компоновщика настроек.
				КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Количество();
				
				// Установка имен колонок и заголовка на текущем языке
				ИзменитьЗаголовкиПоПараметрам(СхемаКомпоновкиДанных);				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат АдресХранилищаСКД;
	
КонецФункции

// Процедура преобразует СКД.
// 
// Параметры:
//  ТекущаяНастройкаКД.
//  ИсточникНастройкиПоУмолчанию.
// 
Процедура ПреобразоватьСКД(ТекущаяНастройкаКД, ИсточникНастройкиПоУмолчанию)	
    						
	// Добавим в текущий вариант идентификаторы пользовательских настроек.
	ИдентификаторПн = ?(ЗначениеЗаполнено(ИсточникНастройкиПоУмолчанию.Выбор.ИдентификаторПользовательскойНастройки), ИсточникНастройкиПоУмолчанию.Выбор.ИдентификаторПользовательскойНастройки, Строка(Новый УникальныйИдентификатор));
	ТекущаяНастройкаКД.Выбор.ИдентификаторПользовательскойНастройки = ИдентификаторПн;
	ИдентификаторПн = ?(ЗначениеЗаполнено(ИсточникНастройкиПоУмолчанию.Отбор.ИдентификаторПользовательскойНастройки), ИсточникНастройкиПоУмолчанию.Отбор.ИдентификаторПользовательскойНастройки, Строка(Новый УникальныйИдентификатор));
	ТекущаяНастройкаКД.Отбор.ИдентификаторПользовательскойНастройки = ИдентификаторПн;
	ИдентификаторПн = ?(ЗначениеЗаполнено(ИсточникНастройкиПоУмолчанию.Порядок.ИдентификаторПользовательскойНастройки), ИсточникНастройкиПоУмолчанию.Порядок.ИдентификаторПользовательскойНастройки, Строка(Новый УникальныйИдентификатор));
	ТекущаяНастройкаКД.Порядок.ИдентификаторПользовательскойНастройки = ИдентификаторПн;
	ИдентификаторПн = ?(ЗначениеЗаполнено(ИсточникНастройкиПоУмолчанию.УсловноеОформление.ИдентификаторПользовательскойНастройки), ИсточникНастройкиПоУмолчанию.УсловноеОформление.ИдентификаторПользовательскойНастройки, Строка(Новый УникальныйИдентификатор));
	ТекущаяНастройкаКД.УсловноеОформление.ИдентификаторПользовательскойНастройки = ИдентификаторПн;
	ИдентификаторПн = ?(ЗначениеЗаполнено(ИсточникНастройкиПоУмолчанию.Структура.ИдентификаторПользовательскойНастройки), ИсточникНастройкиПоУмолчанию.Структура.ИдентификаторПользовательскойНастройки, Строка(Новый УникальныйИдентификатор));
	ТекущаяНастройкаКД.Структура.ИдентификаторПользовательскойНастройки = ИдентификаторПн;
						
КонецПроцедуры // ПреобразоватьСКД()
 
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
